<template>
    <div>
        <j-table :data="user"></j-table>
    </div>
</template>

<script>
export default {
    name: 'the-demo-table',
    data() {
        return {
            user: {
                list: [
                    {
                        '姓名/age': '伍杰瑞',
                        '年龄/age': '6',
                        '电话/tel': '13761660735',
                        '日期/date': '2068/04/05',
                    },
                    {
                        '姓名/age': '杨洋辉',
                        '年龄/age': '12',
                        '电话/tel': '17025475035',
                        '日期/date': '2059/08/16',
                    },
                    {
                        '姓名/age': '蒋心怡',
                        '年龄/age': '2',
                        '电话/tel': '18787165659',
                        '日期/date': '2052/04/15',
                    },
                    {
                        '姓名/age': '欧阳尚',
                        '年龄/age': '82',
                        '电话/tel': '19880260356',
                        '日期/date': '2049/02/04',
                    },
                    {
                        '姓名/age': '殷欣汝',
                        '年龄/age': '8',
                        '电话/tel': '18964666999',
                        '日期/date': '1059/10/30',
                    },
                    {
                        '姓名/age': '安晓东',
                        '年龄/age': '20',
                        '电话/tel': '13560946008',
                        '日期/date': '2077/06/30',
                    },
                    {
                        '姓名/age': '凤昊轩',
                        '年龄/age': '9',
                        '电话/tel': '18739900056',
                        '日期/date': '2048/12/12',
                    },
                ],
            },
        };
    },
};
</script>

<style>
</style>
